<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.CreativeCloudApp_NAV</string>
	<key>Input</key>
	<dict>
		<key>FETCH_ICON</key>
		<string>false</string>
		<key>FETCH_RELEASE_NOTES</key>
		<string>false</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/AdobeCC</string>
		<key>NAME</key>
		<string>CreativeCloudApp</string>
		<key>ccpinfo</key>
		<dict>
			<key>Language</key>
			<string>en_US</string>
			<key>Products</key>
			<array>
				<dict>
					<key>baseVersion</key>
					<string></string>
					<key>sapCode</key>
					<string></string>
					<key>version</key>
					<string>latest</string>
				</dict>
			</array>
			<key>adminPrivilegesEnabled</key>
			<true/>
			<key>appsPanelEnabled</key>
			<true/>
			<key>customerType</key>
			<string>team</string>
			<key>matchOSLanguage</key>
			<true/>
			<key>organizationName</key>
			<string>ADMIN_PLEASE_CHANGE</string>
			<key>rumEnabled</key>
			<true/>
			<key>updatesEnabled</key>
			<false/>
		</dict>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>developer</key>
			<string>Adobe</string>
			<key>name</key>
			<string>%NAME%</string>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.mosen.munki.Adobe.CreativeCloudApp</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>CreativeCloudFeed</key>
			<dict>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.adobe-ccp-recipes/Adobe/CreativeCloudFeed.py</string>
				<key>sha256_hash</key>
				<string>9a60555d5ae477da7263afab89be02dfdf9e0313cec165099fb704adcb717e22</string>
			</dict>
			<key>CreativeCloudPackager</key>
			<dict>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.adobe-ccp-recipes/Adobe/CreativeCloudPackager.py</string>
				<key>sha256_hash</key>
				<string>916d57cfea69d6dd61ae03b13dfdefcea75729f7277b2cd5d2e358993024b45d</string>
			</dict>
			<key>CreativeCloudVersioner</key>
			<dict>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.adobe-ccp-recipes/Adobe/CreativeCloudVersioner.py</string>
				<key>sha256_hash</key>
				<string>b966b2c311ed7a614555227fac2751dacf37d6dc7065cbcc42faa1ffa4aac949</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.mosen.munki.Adobe.CreativeCloudApp</key>
			<dict>
				<key>git_hash</key>
				<string>66c7fb797cd3333035dd28cc843572ad49e520a5</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.adobe-ccp-recipes/Adobe/CreativeCloudApp.munki.recipe</string>
				<key>sha256_hash</key>
				<string>e2faaf28fc003f02706f752760c69f6143c17125318505fc31aea444605cb177</string>
			</dict>
			<key>com.github.mosen.pkg.Adobe.CreativeCloudApp</key>
			<dict>
				<key>git_hash</key>
				<string>87c3dda7137915bf9953da26f8c59182dee310fd</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.adobe-ccp-recipes/Adobe/CreativeCloudApp.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>d9ec25c6fbeb4c7b8b136bf41ad10c9752d47ce1eef1c6e0518d102789157a2c</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
