<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.Tableau_NAV</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://www.tableau.com/downloads/desktop/mac</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Tableau</string>
		<key>NAME</key>
		<string>TableauDesktop</string>
		<key>pkg_ids_set_optional_true</key>
		<array>
			<string>com.tableausoftware.desktopShortcut</string>
		</array>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Tableau</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Tableau Desktop is data visualization software that lets you see and understand data in minutes.</string>
			<key>display_name</key>
			<string>Tableau Desktop</string>
			<key>installer_choices_xml</key>
			<array>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>com.tableausoftware.desktop.app</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>0</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>com.tableausoftware.desktopShortcut</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>com.amazon.redshiftodbc</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>com.tableausoftware.mysql</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>com.tableausoftware.oracle</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>com.tableausoftware.postgresql</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>com.simba.sparkodbc</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>com.simba.sqlserverodbc</string>
				</dict>
			</array>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.gmarnin.munki.tableau-desktop</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>com.github.keeleysam.recipes.GoogleTalkPlugin/MunkiPkginfoReceiptsEditor</key>
			<dict>
				<key>git_hash</key>
				<string>d097018081313411cc6d8f77bd82f1da3a1b400b</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.keeleysam-recipes/GoogleTalkPlugin/MunkiPkginfoReceiptsEditor.py</string>
				<key>sha256_hash</key>
				<string>5d7c2976edc460f6bf5632a5b579405ac3f070782f30fde8c504ac42d01afd99</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.gmarnin.download.tableau-desktop</key>
			<dict>
				<key>git_hash</key>
				<string>4d88bf7e0abd7ba49e17bba4d3df93da2b5ba8dc</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.gmarnin-recipes/Tableau/Tableau.download.recipe</string>
				<key>sha256_hash</key>
				<string>3bb9619ae20b1c1ce4b293d54a508b078ebadeea0f4270c466b1ebde01d19247</string>
			</dict>
			<key>com.github.gmarnin.munki.tableau-desktop</key>
			<dict>
				<key>git_hash</key>
				<string>15780f78472f7e19550650a82590bfc62032d414</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.gmarnin-recipes/Tableau/Tableau.munki.recipe</string>
				<key>sha256_hash</key>
				<string>0f57bbb4a8135d840a8327da8144f2b4b988365a4e4b0a2dd08473e78503eef7</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
